package ch10;

public class ch10_11 {
	public static void main(String[] args) {
		double rate = 0.06;
		double capital = 100000;
		double capitalInfo;
		for( int i = 1 ; i <= 20; i++) {
			capitalInfo = capital * Math.pow((1.0 + rate), i);
			System.out.printf("第%2d 年後本金和是  %10.2f\n", i, capitalInfo);
//			第 1 年後本金和是   106000.00
//			第 2 年後本金和是   112360.00
//			第 3 年後本金和是   119101.60
//			第 4 年後本金和是   126247.70
//			第 5 年後本金和是   133822.56
//			第 6 年後本金和是   141851.91
//			第 7 年後本金和是   150363.03
//			第 8 年後本金和是   159384.81
//			第 9 年後本金和是   168947.90
//			第10 年後本金和是   179084.77
//			第11 年後本金和是   189829.86
//			第12 年後本金和是   201219.65
//			第13 年後本金和是   213292.83
//			第14 年後本金和是   226090.40
//			第15 年後本金和是   239655.82
//			第16 年後本金和是   254035.17
//			第17 年後本金和是   269277.28
//			第18 年後本金和是   285433.92
//			第19 年後本金和是   302559.95
//			第20 年後本金和是   320713.55
		
		}
	}

}
